# Subsetting data: Learning notebook

In this notebook we will cover the following: 

    - Selecting columns (brackets and dot notation)
    - Selecting rows (loc and iloc)
    - Subsetting on conditions
    - Dtypes
    - Select Dtypes
    - nlargest
    - nsmallest

First, we import pandas, like we learned in the previous unit:

In [1]:
import pandas as pd

Now, we read the data that we'll use in this unit from the file __airbnb_input.csv__, which is located in the __data/__ directory.

For this, we'll use function __read_csv( )__, which was alreay shown in the previous unit.
We want to use column __room_id__ as the DataFrame index, and for that we use the argument __index_col__ in function read_csv( ).

In [2]:
# Read the data in file airbnb_input.csv into a pandas DataFrame and use column room_id as the DataFrame index.
df = pd.read_csv('data/healthcare_costs.csv')
df = df.set_index('patient_id')

# Preview the first rows of the DataFrame.
df.head()

            age     sex     bmi  children smoker     region      charges
patient_id
483          51  female  39.500         1     no  southwest   9880.06800
101          30    male  25.460         0     no  northeast   3645.08940
674          44  female  43.890         2    yes  southeast  46200.98510
1042         20    male  30.685         0    yes  northeast  33475.81715
693          24    male  23.655         0     no  northwest   2352.96845

## Selecting columns

### Selecting columns by name - dot notation

Using __dot notation__, you can select a column from a DataFrame, obtaining a Series with the column values.

This is how you can select the room_type column using dot notation:

In [3]:
df.region

patient_id
483     southwest
101     northeast
674     southeast
1042    northeast
693     northwest
          ...
1136    southwest
520     northeast
912     northwest
847     southeast
609     southwest
Name: region, Length: 1338, dtype: object

### Selecting columns by name - brackets notation

Using __brackets__, you can select one or more columns from the DataFrame.

This is how you can select the room_type column using brackets. Note that the output is a Series:

In [4]:
df['region']

patient_id
483     southwest
101     northeast
674     southeast
1042    northeast
693     northwest
          ...
1136    southwest
520     northeast
912     northwest
847     southeast
609     southwest
Name: region, Length: 1338, dtype: object

This is how you can select the room_type and neighborhood columns using brackets. Note that the output is a DataFrame:

In [5]:
df[['sex', 'region']]

               sex     region
patient_id
483         female  southwest
101           male  northeast
674         female  southeast
1042          male  northeast
693           male  northwest
...            ...        ...
1136        female  southwest
520         female  northeast
912         female  northwest
847           male  southeast
609           male  southwest

[1338 rows x 2 columns]

## Selecting rows

### Selecting rows by index position - iloc

With function [iloc](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.iloc.html) you can select specific rows from a DataFrame.

In order to specify the rows you want to select you can use the row position (integer starting from 0), a list, or an array slice.

This is how you can select the first row (remember that Python starts indexing with a 0). Note that the output is a Series:

In [6]:
df.iloc[0]

age                51
sex            female
bmi              39.5
children            1
smoker             no
region      southwest
charges       9880.07
Name: 483, dtype: object

This is how you select rows 0, 2, 4 and 6. Note that the output is a DataFrame:

In [7]:
df.iloc[[0, 2, 4, 6]]

            age     sex     bmi  children smoker     region      charges
patient_id
483          51  female  39.500         1     no  southwest   9880.06800
674          44  female  43.890         2    yes  southeast  46200.98510
693          24    male  23.655         0     no  northwest   2352.96845
95           28  female  37.620         1     no  southeast   3766.88380

This is how you select the first 3 rows:

In [8]:
df.iloc[:3]

            age     sex    bmi  children smoker     region     charges
patient_id
483          51  female  39.50         1     no  southwest   9880.0680
101          30    male  25.46         0     no  northeast   3645.0894
674          44  female  43.89         2    yes  southeast  46200.9851

### Selecting rows by index name - loc

With function [loc](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.loc.html) you can select specific rows from a DataFrame, like with iloc.

The difference here is that you specify the rows to select using the rows' indexes instead of the rows' positions in the DataFrame.

This is how you select room 29396:

In [9]:
df.loc[17]

age                23
sex              male
bmi            23.845
children            0
smoker             no
region      northeast
charges       2395.17
Name: 17, dtype: object

Note that if you search for an index that doesn't exist, you'll get a KeyError:

In [10]:
df.loc[9000]

KeyError: 9000

## Subsetting data on conditions

Using brackets notation, we can use conditions to subset data from the DataFrame.

By doing this, we get a DataFrame that (most likelly) has a different shape from the initial one, i.e, it's only a subset of it's rows.

Note that this is different from what we saw in the mask/filter functions: these functions don't change the DataFame shape, instead, they just replace the values that we don't want with NaNs.

Here we're subsetting the DataFrame to get all the male patients.

In [11]:
df.sex == 'male'

patient_id
483     False
101      True
674     False
1042     True
693      True
        ...
1136    False
520     False
912     False
847      True
609      True
Name: sex, Length: 1338, dtype: bool

Here we're subsetting the DataFrame to get all the male patients.

Note the DataFrame shape!

In [12]:
df[df.sex == 'male']

            age   sex     bmi  children smoker     region      charges
patient_id
101          30  male  25.460         0     no  northeast   3645.08940
1042         20  male  30.685         0    yes  northeast  33475.81715
693          24  male  23.655         0     no  northwest   2352.96845
1007         47  male  28.215         3    yes  northwest  24915.22085
1274         26  male  27.060         0    yes  southeast  17043.34140
...         ...   ...     ...       ...    ...        ...          ...
965          35  male  27.100         1     no  southwest   4746.34400
814          36  male  34.430         2     no  southeast   5584.30570
1304         42  male  24.605         2    yes  northeast  21259.37795
847          23  male  50.380         1     no  southeast   2438.05520
609          30  male  37.800         2    yes  southwest  39241.44200

[676 rows x 7 columns]

As another example, we're selecting the males older than 50.

Note the parenthesis around each condition, they're required!

In [14]:
df[(df.sex == 'male') & (df.age > 50)]

            age   sex     bmi  children smoker     region      charges
patient_id
1321         62  male  26.695         0    yes  northeast  28101.33305
323          57  male  40.945         0     no  northeast  11566.30055
382          55  male  33.000         0     no  southeast  20781.48892
1275         57  male  23.700         0     no  southwest  10959.33000
956          54  male  30.800         1    yes  southeast  41999.52000
...         ...   ...     ...       ...    ...        ...          ...
1061         57  male  27.940         1     no  southeast  11554.22360
18           56  male  40.300         0     no  southwest  10602.38500
1294         58  male  25.175         0     no  northeast  11931.12525
793          53  male  20.900         0    yes  southeast  21195.81800
1265         64  male  23.760         0    yes  southeast  26926.51440

[175 rows x 7 columns]

## Data Types

DataFrames have a class attribute that shows us the data type of each column. It's called __dtypes__ and can be used like this:

In [15]:
df.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
charges     float64
dtype: object

Note that strings have the dtype __object__.

__Dtypes__ can also be used to subset DataFrames. For instance, this is how we select all the float64 columns from the DataFrame:

In [16]:
df.select_dtypes(include=['float64'])

               bmi      charges
patient_id
483         39.500   9880.06800
101         25.460   3645.08940
674         43.890  46200.98510
1042        30.685  33475.81715
693         23.655   2352.96845
...            ...          ...
1136        25.000   7623.51800
520         27.360  25656.57526
912         26.695  14382.70905
847         50.380   2438.05520
609         37.800  39241.44200

[1338 rows x 2 columns]

## nlargest and nsmallest

[nlargest](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.nlargest.html) is a function that can be used to select the n rows that have the largest values regarding certain column(s).

For instance, this is how we select the two rooms that had the highest number of reviews.

In [17]:
df.nlargest(n=2, columns='bmi')

            age   sex    bmi  children smoker     region     charges
patient_id
1317         18  male  53.13         0     no  southeast   1163.4627
1047         22  male  52.58         1    yes  southeast  44501.3982

[nsmallest](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.nsmallest.html)... 
Well, I'll let you extrapolate :)

But here's an example, where we sellect the 5 cheapest rooms:

In [18]:
df.nsmallest(n=5, columns='bmi')

            age     sex     bmi  children smoker     region      charges
patient_id
172          18    male  15.960         0     no  northeast   1694.79640
428          21  female  16.815         1     no  northeast   3167.45585
1226         38    male  16.815         2     no  northeast   6640.54485
412          26  female  17.195         2    yes  northeast  14455.64405
250          18    male  17.290         2    yes  northeast  12829.45510